olliw42/stm32ll-lib/src/stdstm32-uartd.h
#ifdef UARTD_INVERTED
#ifdef UARTD_USE_TX
  LL_USART_SetTXPinLevel(UARTD_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UARTD_USE_RX
  LL_USART_SetRXPinLevel(UARTD_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UARTD_USE_RX || defined UARTD_USE_TX_ISR
#ifdef UARTD_PREEMPTIONPRIORITY
  #error Legacy UARTD_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTD_SUBPRIORITY
  #error Legacy UARTD_SUBPRIORITY used !
#endif
#ifdef UARTD_PRIORITY
#error Legacy UARTD_PRIORITY used !
#endif
#ifndef UARTD_IRQ_PRIORITY
  #define UARTD_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTD_IRQn, UARTD_IRQ_PRIORITY);
#endif

#ifdef UARTD_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTD_UARTx);
  LL_USART_DisableIT_TC(UARTD_UARTx);
  LL_USART_ClearFlag_TC(UARTD_UARTx);
  // Flush buffer
  uartd_txwritepos = uartd_txreadpos = 0;
#endif

#ifdef UARTD_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UARTD_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UARTD_UARTx);
#endif
  // Flush buffer
  uartd_rxwritepos = uartd_rxreadpos = 0;
#ifdef UARTD_USE_RXERRORCOUNT
  uartd_errorcnt_rxnoise = 0;
  uartd_errorcnt_rxframe = 0;
  uartd_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UARTD_UARTx->CR2, USART_CR2_CLKEN);
  CLEAR_BIT(UARTD_UARTx->CR3, USART_CR3_HDSEL);
#if defined USART_CR2_LINEN
  CLEAR_BIT(UARTD_UARTx->CR2, USART_CR2_LINEN);
#endif
#if defined USART_CR3_SCEN || defined USART_CR3_IREN // assume that always both are defined
  CLEAR_BIT(UARTD_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
#endif

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UARTD_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UARTD_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UARTD_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UARTD_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UARTD_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32F3 || defined STM32WL || defined STM32F0
#if !defined UARTD_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UARTD_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UARTD_UARTx);

#if defined STM32G4 ||defined STM32F3 || defined STM32WL || defined STM32F0
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UARTD_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UARTD_UARTx)))) {};
#endif
}


void uartd_init(void)
{
  uartd_init_isroff();
  uartd_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UARTD_H
